---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelSupplyFromParam
source: html/dcc8054b-a903-3016-3719-aab742f4f655.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecPanelSupplyFromParam Property

"Supply From"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecPanelSupplyFromParam { get; }
```